# GetLatestSystemsAnalysisReport Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSystemsAnalysisReport..::..GetLatestSystemsAnalysisReport Method
ViewSystemsAnalysisReport Class See Also
---
Gets the latest report of systems analysis.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public static ElementId GetLatestSystemsAnalysisReport(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function GetLatestSystemsAnalysisReport ( _
	document As Document _
) As ElementId
```

Visual C++
---
```text
public:
static ElementId^ GetLatestSystemsAnalysisReport(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ViewSystemsAnalysisReport Class
Autodesk.Revit.DB.Analysis Namespace